package com.naver.erp;

import java.util.List;
import java.util.Map;

import org.apache.ibatis.annotations.Mapper;

@Mapper 		// Repository가 아니라 Mapper 붙인이유는 인터페이스 구현한 클래스를 자동으로 생성해줘서 boardDAOimp 클래스 없음.
public interface BoardDAO {
	//------------------------------------
	//게시판 총 개수 리턴하는 메소드 선언 
	//------------------------------------
	int getBoardListCntAll( );
	//------------------------------------
	//게시판 검색 결과 리턴하는 메소드 선언 
	//------------------------------------
	int getBoardListCnt( BoardSearchDTO boardSearchDTO );
	//------------------------------------
	//게시판 검색 결과(n행m열) 리턴하는 메소드 선언 
	//------------------------------------
	List<Map<String,String>> getBoardList( BoardSearchDTO boardSearchDTO );
	
	
	//======================================================
	//조회수를 1증가하고 적용된 행의 개수를 얻는 메소드 선언
	//======================================================
	int updateReadcount(int b_no);
	
	//======================================================
	//1개의 게시판 정보를 리턴하는 메소드 선언
	//======================================================
	BoardDTO getBoard(int b_no);
	
	//======================================================
	//게시판 존재 개수를 리턴하는 메소드 선언
	//======================================================
	int getBoardCnt(int b_no);
	
	//======================================================
	//수정/삭제 할 게시판의 비밀번호 존재 개수를 리턴하는 메소드 선언
	//======================================================
	int getBoardPwdCnt( BoardDTO boardDTO );
	
	//======================================================
	//게시판 수정 명령한 후 수정 적용행의 개수를 리턴하는 메소드 선언
	//======================================================
	int updateBoard(BoardDTO board2);
	
	
	//======================================================
	//후손글의 개수 리턴하는 메소드 선언
	//======================================================
	int getBoardChildrenCnt(BoardDTO boardDTO);
	
	//======================================================
	//제목과 내용을 삭제하는 메소드 선언
	//자식 있는 글의 게시판 글 자체는 삭제하지 말고
	//제목과 내용을 "삭제물입니다"라고 수정한 후
	//수정 적용행의 개수를 얻는 메소드다.
	//======================================================
	int updateBoardEmpty(BoardDTO board2);
	
	//======================================================
	//게시판 삭제 명령한 후 삭제 적용행의 개수를 얻는 메소드 선언
	//======================================================
	int deleteBoard(BoardDTO board2);
	

	//======================================================
	//게시판 글 출력번호 1 증가하고 수정 행의 개수 리턴하는 메소드 선언
	//======================================================
	int upPrintNo(BoardDTO boardDTO);
	
	
	//======================================================
	//게시판 글 입력 후 입력 적용 행의 개수 리턴하는 메소드 선언
	//======================================================
	int insertBoard(BoardDTO boardDTO);
	
		
	
}
